[
  {
    "messageId": "1468266278606209210",
    "title": "Hey everyone! \n\nWe have noticed a curren",
    "highlight": "Discord",
    "text": "Hey everyone! \n\nWe have noticed a current discord scam where impersonators try to look like our official staff by using a misspelled username, for example [wwmoffical], and DM users with a fake investment idea.\n\nPlease know that the dev team will never send you unsolicited DMs, don't make any payments to these impersonators and don't share any personal information or passwords with them. Report these messages to Discord as scam and let our moderators know through <@1391796610467500064> if you see one in your DMs.\n\nWhen in doubt, verify through official channels (pinned announcements, server staff list, or a mod via GooseMail). Stay safe!",
    "date": "2026. 02. 03.",
    "author": "armoredsoldiers",
    "image": "https://armoredsoldiers.github.io/wwm-news/default.jpg"
  },
  {
    "messageId": "1468266229541240892",
    "title": "**Hello everyone,**\n\nWe are aware of **G",
    "highlight": "Discord",
    "text": "**Hello everyone,**\n\nWe are aware of **Guild War not being available to join right now**, despite us all receiving the information that the Preparation Phase was only January 9th until January 16th, and that the mode would officially be in Competition Phase and joinable on January 17th until February 6th. *pictured below*\n\nWe have sent additional notices to the proper staff who can look into this! We appreciate your patience,  but can assure you the Moderation Team is making sure these kinds of concerns are mentioned as directly as possible. \n\nThank you and we're sorry this is happening too.  :emoji_109:\n\nPlease understand the Moderation team are not developers, and are experiencing everything at the same time as you all, and noting these reports to be forwarded ASAP. We noticed it appears to be isolated to Yunya regions (EU & Africa) as of January 17th. We do not know if it will continue to not work tomorrow unfortunately.\n\nGvG Status as of Jan 17th. \nCanglang ✅ \nYunya :z1_X: \nYongu ✅",
    "date": "2026. 02. 03.",
    "author": "armoredsoldiers",
    "image": "https://cdn.discordapp.com/attachments/1467110224371515413/1468266229247508777/image.png?ex=698364fc&is=6982137c&hm=879c93d64c66fd1123cd0911892042601a41a5754378de60b954a798524023de&"
  }
]